"""
Задание 3.	Сформировать из введенного числа
обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены
Используем операции % //. Операции взятия по индексу применять нельзя.

Решите через рекурсию. В задании нельзя применять циклы.

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
Не забудьте проверить на числе, которое оканчивается на 0.
1230 -> 0321
"""


def revers_numbers(number_in):
    if number_in < 10:
        return str(number_in)
    else:
        return str(number_in % 10) + revers_numbers(number_in // 10)


number_to_revers = int(input('Введите число, которое требуется перевернуть:\n'))
print(f'Перевернутое число: {revers_numbers(number_to_revers)}')
